app/controllers/admin/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$HoZz3bN/OSt919Nn57KLgOBpwWnGqikrmrTFcGc4rPjyb58K/U8/O"], ["updated_at", "2021-09-08 08:07:44.745844"], ["id", 15]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT COUNT(*) FROM "users" WHERE "users"."admin" = $1  [["admin", true]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 22]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 15]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 17]]
---
  def destroy
    if User.where(admin: true).count == 1 && @user.admin == true
      respond_to do |format|
        format.html { redirect_to admin_users_url, notice: "Impossible de supprimer le dernier administrateur." }
      end
    else
      @user.tasks.destroy_all
      @user.destroy

UPDATE "users" SET "admin" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["admin", false], ["updated_at", "2021-09-07 23:17:02.855622"], ["id", 1]]
---
  def do_admin
    if @user.update(admin: true)

SELECT COUNT(*) FROM "users" WHERE "users"."admin" = $1  [["admin", true]]
UPDATE "users" SET "admin" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["admin", false], ["updated_at", "2021-09-08 13:18:11.253944"], ["id", 17]]
---
  def not_do_admin
    if User.where(admin: true).count == 1
      respond_to do |format|
        format.html { redirect_to admin_users_url, notice: "Impossible de supprimer le dernier administrateur." }
      end
    else
      if @user.update(admin: false)