app/views/tasks/index.html.erb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC
SELECT "task_labels".* FROM "task_labels" WHERE "task_labels"."task_id" = $1  [["task_id", 39]]
---
        <td>
          <% task.task_labels.each do |l| %>