app/views/tasks/show.html.erb

  <strong>Labels:</strong>
  <% @task.task_labels.each do |l| %>
---
SELECT "task_labels".* FROM "task_labels" WHERE "task_labels"."task_id" = $1  [["task_id", 39]]