app/views/users/show.html.erb

  <strong>Nombre de tâche:</strong>
  <%= @user.tasks.count %>
---
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 5]]