app/controllers/labels_controller.rb

SELECT "labels".* FROM "labels" WHERE "labels"."user_id" = $1  [["user_id", 5]]
---
  def index
    @labels = Label.where(user_id: current_user.id)