app/controllers/tasks_controller.rb

  def index
    @labels = Label.where(user_id: 0).or(Label.where(user_id: current_user.id))
    if params[:task].present?
      if params[:task][:name].present? && params[:task][:status].present?
        @tasks = Task.search_by_name_and_status(params[:task][:name],params[:task][:status],current_user).page(params[:page])
      elsif params[:task][:name].present?
        @tasks = Task.search_by_name(params[:task][:name],current_user).page(params[:page])
      elsif params[:task][:status].present?
        @tasks = Task.search_by_status(params[:task][:status],current_user).page(params[:page])
      elsif params[:task][:label_id].present?
        @tasks = Task.search_by_label(params[:task][:label_id],current_user).page(params[:page])
      else
        @tasks = current_user.tasks.order(created_at: :desc).page(params[:page])
      end
    elsif params[:sort_expired]=='true'
      @tasks = current_user.tasks.order(expired_at: :desc).page(params[:page])
    elsif params[:sort_priority]=='true'
      @tasks = current_user.tasks.order(priority: :desc).page(params[:page])
---
SELECT "labels".* FROM "labels" WHERE ("labels"."user_id" = $1 OR "labels"."user_id" = $2)  [["user_id", 0], ["user_id", 5]]
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC
SELECT "tasks".* FROM "tasks" WHERE (name LIKE '%j%') AND "tasks"."status" = $1  [["status", "Terminé"]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."status" = $2 LIMIT $3 OFFSET $4  [["user_id", 5], ["status", "Non demarré"], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."status" = $2  [["user_id", 5], ["status", "Non demarré"]]
SELECT  "task_labels".* FROM "task_labels" WHERE "task_labels"."label_id" = $1 LIMIT $2  [["label_id", 14], ["LIMIT", 11]]
SELECT  "tasks".* FROM "tasks" ORDER BY "tasks"."expired_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT  "tasks".* FROM "tasks" ORDER BY "tasks"."priority" DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]

  def new
    @task = Task.new
    @labels = Label.where(user_id: 0).or(Label.where(user_id: current_user.id))
---
SELECT "labels".* FROM "labels" WHERE ("labels"."user_id" = $1 OR "labels"."user_id" = $2)  [["user_id", 0], ["user_id", 5]]

  def create
    @task = Task.new(task_params)
    @task.user_id = current_user.id
    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "detail", "created_at", "updated_at", "expired_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "s cjsc"], ["detail", "jsjcsjcscsc"], ["created_at", "2021-09-06 21:06:24.998365"], ["updated_at", "2021-09-06 21:06:24.998365"], ["expired_at", "2021-09-06 21:06:00"], ["user_id", 5]]

  def update
    respond_to do |format|
      if @task.update(task_params)
        @task.task_labels.destroy_all
---
UPDATE "tasks" SET "expired_at" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["expired_at", "2021-09-10 15:31:00"], ["updated_at", "2021-09-06 15:31:49.543374"], ["id", 18]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 16]]