app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "detail", "created_at", "updated_at", "expired_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "knekfnkkk"], ["detail", "fknknef"], ["created_at", "2021-09-04 10:29:44.873108"], ["updated_at", "2021-09-04 10:29:44.873108"], ["expired_at", "2021-09-15"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "expired_at" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["expired_at", "2021-09-07"], ["updated_at", "2021-09-04 10:28:34.825683"], ["id", 5]]