app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Voltorb1"], ["password_digest", "$2a$12$fPD/XOOzcG1n/0e/Nrpuku84IQCKPNh.BqR/llTsHRUDhSYfYH/Ca"], ["updated_at", "2021-09-06 21:53:43.028829"], ["id", 1]]