app/models/task.rb

    scope :search_by_label, -> (label_id,current_user){
        current_user.tasks.where(id: TaskLabel.where(label_id: label_id).pluck(:task_id))
---
SELECT "task_labels"."task_id" FROM "task_labels" WHERE "task_labels"."label_id" = $1  [["label_id", 14]]