app/views/admin/users/index.html.erb

SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 1]]
---
        <td><%= user.email %></td>
        <td><%= user.tasks.count %></td>