app/views/admin/users/show.html.erb

  <strong>Nombre de tâche:</strong>
  <%= @user.tasks.count %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 5]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 5]]

  <tbody>
    <% @user.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 5]]